snakeiscoding/stm32f105_lcm_simulator/Libraries/FileSystem/usb_host/stm32uh/stm32uh.c
/****************************************************************************
 *
 *            Copyright (c) 2003-2009 by HCC Embedded
 *
 * This software is copyrighted by and is the sole property of
 * HCC.  All rights, title, ownership, or other interests
 * in the software remain the property of HCC.  This
 * software may only be used in accordance with the corresponding
 * license agreement.  Any unauthorized use, duplication, transmission,
 * distribution, or disclosure of this software is expressly forbidden.
 *
 * This Copyright notice may not be removed or modified without prior
 * written consent of HCC.
 *
 * HCC reserves the right to modify this software without notice.
 *
 * HCC Embedded
 * Budapest 1133
 * Vaci Ut 110
 * Hungary
 *
 * Tel:  +36 (1) 450 1302
 * Fax:  +36 (1) 450 1303
 * http: www.hcc-embedded.com
 * email: info@hcc-embedded.com
 *
 ***************************************************************************/
#include "stm32_reg.h"
#include "stm32uh_hub.h"
#include "pmgr.h"
#include "os.h"
#include "stm32uh.h"
// 2013.11.26
#include "stm32f10x_it.h"

#define MAX_RETRIES				3

/* timeout in ms for channel response, if no response within this time then treat transfer as erroneous */
#define CHANNEL_TIMEOUT			10

/* non periodic transfers can only be scheduled if at least NP_FT_REMAIN clock cycles are left in the frame */
/* this is required because if a non-periodic transfer doesn't fit in the current frame and will be executed in */
/* the next frame then all periodic transfers scheduled for the next frame will generate frame overrun error */
#define NP_FT_REMAIN			0x1000

/* number of channels available for transfers */
#define TRANSFER_CHANNELS		1

/* Minimum poll interval for interrupt endpoints */
#define MIN_INTERVAL			10



#define ISO_BASE				0
#define INT_BASE				MAX_ISO_TRANSFERS
#define NP_BASE					(INT_BASE+MAX_INT_TRANSFERS)


#define CONTROL_EP				(MAX_DEVICE+1)
#define TOTAL_EP				(CONTROL_EP+MAX_EP)
#define TOTAL_TRANSFERS			(MAX_NP_TRANSFERS+MAX_INT_TRANSFERS+MAX_ISO_TRANSFERS)


#define TR_ST_STOPPED			0
#define TR_ST_WAITING			1
#define TR_ST_RUNNING			2
#define TR_ST_TIMEOUT                   3     // Added by Jason 20110101--

#define SCHED_INT_OFF			0
#define SCHED_INT_ON			1


/* FIFO */
typedef struct {
  hcc_u8 r,w;
  void *ptr[TOTAL_EP];
} t_fifo;


/* transfer descriptor */
typedef struct {
  hcc_u8 ch;			/* transfer channel */
  hcc_u8 ppos;			/* pending position */

  hcc_u8 dir;			/* current direction */
  hcc_u8 retry;			/* no. retries */
  hcc_u8 nak;			/* last transfer was NAK-ed */
  hcc_u16 ch_timeout;	/* channel timeout */
  hcc_u32 timeout;		/* timeout */

  hcc_u16 npkt;
  hcc_u32 tsize;		/* transfer size */
  hcc_u32 cframe;		/* current frame */

  hcc_u32 hcchar;		/* HCCHAR register value */
  hcc_u32 hctsiz;		/* HCTSIZE register value */
} t_td;


/* endpoint descriptor */
typedef struct {
  hcc_u8 used;			/* used entry */

  hcc_u8 daddr;			/* device address */
  hcc_u8 ep;			/* endpoint address */
  hcc_u8 type;			/* endpoint type */
  hcc_u8 dir;			/* direction */
  hcc_u16 psize;		/* packet size */
  hcc_u8 interval;		/* poll interval */

  hcc_u8 speed;			/* speed */
  hcc_u8 hub_daddr;		/* HUB address */

  hcc_u32 nframe;		/* no. frames till next transfer - for INT endpoints */
  hcc_u8 pid;			/* curent PID value */

  t_usbh_transfer *uht;	/* transfer */
  t_td td;				/* current transfer - describes the channel */
} t_ed;


/* UHT driver area */
typedef struct {
  volatile hcc_u32 state;	/* state of the transfer */
  t_usbh_transfer *nuht;	/* next uht - for ISO transfers */
} t_uht_da;

/************************************************************************************************************************/
/********************************************** Local variables *********************************************************/
/************************************************************************************************************************/

static t_ed ed[TOTAL_EP];					/* endpoint descriptor */
static t_ed *ch_ed[TRANSFER_CHANNELS];		/* channel to ed */
static t_ed *pending_ed[TOTAL_TRANSFERS];	/* pending ED list (NP/ISO/INT) */
static hcc_uint np_pending_ed_cnt;			/* non periodic pending ED count */
static hcc_uint sched_int_state;			/* schedule state */
static t_fifo c_uht;						/* completed UHT */

/***** mutexes and events *****/
static OS_MUTEX_TYPE *stm32uh_mutex;
static OS_EVENT_BIT_TYPE stm32uh_event_bit;

/************************************************************************************************************************/

static void _stm32uh_transfer_start (t_ed *aed, hcc_u8 ch);
static void _stm32uh_transfer_init (t_ed *aed);

/************************************************************************************************************************/

/*
** Push to FIFO
** Write can't overwrite unread data because these functions are used for completed transfers
** and it can't have more elements than TOTAL_EP (if RTOS is used transfer task is always
** the highest priority, so another transfer can't be started before handling the completed transfer)
*/
static void _stm32uh_push (t_fifo *fifo, void *ptr)
{
  fifo->ptr[fifo->w]=ptr;
  if (++fifo->w==TOTAL_EP) fifo->w=0;
}

/*
** Pop from FIFO
*/
static void *_stm32uh_pop (t_fifo *fifo)
{
  void *ptr=fifo->ptr[fifo->r];
  if (ptr)
  {
    fifo->ptr[fifo->r]=NULL;
    if (++fifo->r==TOTAL_EP) fifo->r=0;
  }
  return ptr;
}


/*
** Free channel - set waiting state for the belonging transfer
*/
static void _stm32uh_free_channel (hcc_u8 ch)
{
  ch_ed[ch]->td.ch=(hcc_u8)USBH_INVALID;
  ((t_uht_da *)ch_ed[ch]->uht->driver_area)->state=TR_ST_WAITING;	/* put transfer to waiting state */
  ch_ed[ch]=NULL;				/* free channel */
  HCC_Cb(HCC_OTG_HAINTMSK,ch);	/* disable interrupt generation for channel */
  HCC_OTG_HCCHAR(ch)=0;
}


/*
** Remove transfer
** Input: ch - channel
*/
static void _stm32uh_remove_transfer (hcc_u8 ch)
{
  t_ed *aed=ch_ed[ch];
  t_usbh_transfer *uht=aed->uht;
  u32 D_Loop = 0;// 2013.11.26

