snakeiscoding/stm32f105_lcm_simulator/Libraries/FileSystem/usb_host/stm32uh/stm32uh.c
  HCC_OTG_HCCHAR(ch)=HCC_M(CHENA)|HCC_M(CHDIS);	/* disable channel */
  while ((HCC_OTG_HCINT(ch)&HCC_M(CHH))==0)		/* wait till channel is disabled */
  {
      // 2013.11.26
      D_Loop++;
      if(D_Loop >= 0xFFFF)
      {
          D_Loop = 0;
          SCB->AIRCR = 0x05fa0004 ; // Software Reset
          break;
      }
      //
  }
  HCC_OTG_HCINT(ch)=HCC_OTG_HCINT(ch);			/* clear pending interrupts */
  if (aed->td.dir!=USBH_DIR_IN)
  {												/* flush TxFIFO */
    if (aed->type==USBH_TYPE_ISO) HCC_OTG_GRSTCTL=HCC_V(TXFNUM,1)|HCC_V(TXFFLSH,1);
                             else HCC_OTG_GRSTCTL=HCC_V(TXFFLSH,1);
  }
  else
  {
    HCC_OTG_GRSTCTL=HCC_V(RXFFLSH,1);			/* flush RxFIFO */
  }
  _stm32uh_free_channel(ch);
  pending_ed[aed->td.ppos]=NULL;				/* remove from pending list */
  if (aed->td.ppos>=NP_BASE) --np_pending_ed_cnt;

  uht->rc=USBH_ERR_TRANSFER;					/* stop transfer and mark it erroneous */
  aed->uht=NULL;
  _stm32uh_push(&c_uht,uht);
}


/*
** schedule transfers
*/
static hcc_uint _stm32uh_schedule (hcc_uint *np_pos)
{
  hcc_uint rc=0;
  hcc_u8 ch;
  hcc_uint pos=ISO_BASE;
  hcc_uint n;

  for (ch=0;ch_ed[ch] && ch<TRANSFER_CHANNELS;ch++)
    ;
  if (ch<TRANSFER_CHANNELS)
  {
    for (n=0; n<TOTAL_TRANSFERS && ch<TRANSFER_CHANNELS; n++)
    {
      if (pending_ed[pos] && pending_ed[pos]->nframe==0 && pending_ed[pos]->td.ch==(hcc_u8)USBH_INVALID)
      {
        if (((t_uht_da *)(pending_ed[pos]->uht->driver_area))->state==TR_ST_WAITING)
        {
          for (;ch_ed[ch] && ch<TRANSFER_CHANNELS;ch++)
            ;
          if (ch==TRANSFER_CHANNELS) break;				/* no more channels available */
          if (pending_ed[pos]->td.nak==0) _stm32uh_transfer_init(pending_ed[pos]);
          _stm32uh_transfer_start(pending_ed[pos],ch);
          ++rc;
          ++ch;
        }
      }

      /* get next pending position to check, periodic (ISO/INT) transfers are processed in order and */
      /* non-periodic transfers are processed as a ring buffer to equally distribute process time*/
      ++pos;
      if (pos==MAX_ISO_TRANSFERS+MAX_INT_TRANSFERS) pos=*np_pos;
      if (pos==TOTAL_TRANSFERS) pos=NP_BASE;
    }

    if (pos>=NP_BASE)
    {
      *np_pos=pos;
    }
  }

  return rc;
}


/*
** STM32 USBH interrupt handler
*/
OS_ISR_FN(stm32uh_isr_handler)
{
  static hcc_uint np_pos=NP_BASE;		/* non-periodic position */
  static hcc_uint p_sched_n=0;			/* periodic schedule required */

  t_ed *aed;
  hcc_u32 aframe;
  hcc_u32 rframe;
  hcc_u32 sts;
  hcc_u8 se=0;

  sts=HCC_OTG_GINTSTS;

  rframe=HCC_OTG_HFNUM;
  aframe=HCC_R(rframe,FRNUM);			/* get current frame number */
  rframe=HCC_R(rframe,FTREM);			/* get remaining time in the current frame */

  if (sts&HCC_M(HPRTINT))
  {
    stm32uh_hub_isr();					/* host port interrupt */
  }

  if (stm32uh_hub_connected())				/* check if connected, unfortunately if a device is unplugged when */
  {										/* a transfer is active, channel will not indicate this. */
    sched_int_state=SCHED_INT_ON;

    /* SOF - check periodic list */
  if (sts&HCC_M(SOF))
  // if ((sts&HCC_M(SOF))&&(HCC_R(HCC_OTG_HPRT,PCSTS)));//--2010101112 By Jason 
    {
      hcc_u32 msk;
      hcc_u8 ch;
      hcc_uint i;

      for (i=0;i<MAX_ISO_TRANSFERS+MAX_INT_TRANSFERS;i++)
      {									/* go through periodic transfers and check if any needs to be scheduled */
        hcc_uint pos=ISO_BASE+i;
        aed=pending_ed[pos];
        if (aed)
        {
          if (aed->nframe && --aed->nframe==0)
          {
            /* needs to be xecuted in the current frame, so set odd/even execution accordingly */
            if (aframe&1) HCC_S(aed->td.hcchar,ODDFRM);
                     else HCC_C(aed->td.hcchar,ODDFRM);
            ++p_sched_n;				/* increase no. periodic schedules required */
          }
        }
      }

      /* check for timed out transfers - msk contains enabled channels */
      for (msk=HCC_OTG_HAINTMSK,ch=0;msk;msk>>=1,ch++)
      {
        aed=ch_ed[ch];
        /* if transfer is active for this endpoint and timed out */
        if (aed && aed->td.ch_timeout)
        {
          if (--aed->td.ch_timeout==0)
          {
            /* disable channel and retry transfer - next will be a CHH interrupt that will retry
               the transfer or return with an error */
            HCC_OTG_HCCHAR(ch)=HCC_M(CHENA)|HCC_M(CHDIS);
          }
        }
      }

      HCC_OTG_GINTSTS=HCC_V(SOF,1);					/* clear SOF interrupt */
    }

    /* host channel interrupt */
   if (sts&HCC_M(HCINT))
    {
      hcc_u8 hcint_check=0;
      hcc_u8 ch=0;
      hcc_u32 cch=HCC_OTG_HAINT;
      hcc_u32 hcint;
      hcc_u32 stsr=0;
      t_usbh_transfer *uht;
      int rc;

      for (;;)
      {
        if (sts&HCC_M(RXFLVL))			/* RxFIFO non-empty, go through it first */
        {
          stsr=HCC_OTG_GRXSTSP;			/* get RX status */
          sts=HCC_OTG_GINTSTS;
          ch=HCC_R(stsr,CHNUM);
        }
        else							/* if RxFIFO empty then remaining channels */
        {								/* can be processed */
          if (hcint_check==0)
          {
            hcint_check=1;
            ch=0;
            cch=HCC_OTG_HAINT;
          }
          else
          {
            ++ch;
            cch>>=1;
          }
          for (;cch && (cch&1)==0 && ch<TRANSFER_CHANNELS;ch++,cch>>=1)
            ;
          if (!cch) break;
        }

        hcint=HCC_OTG_HCINT(ch);
        HCC_OTG_HCINT(ch)=hcint;		/* clear interrupt */
        
        aed=ch_ed[ch];
        uht=aed->uht;
        rc=USBH_ERR_NOT_COMPLETE;

        if (hcint&HCC_M(XFRC))			/* transfer completed */
        {
          if (aed->td.dir!=USBH_DIR_IN)	/* if not OUT transfer */
          {
            if (aed->type!=USBH_TYPE_ISO)
            {							/* set new PID for non-ISO transfers */
              if (aed->td.npkt&1) aed->pid^=1;
            }
            uht->csize+=aed->td.tsize;
            uht->buf+=aed->td.tsize;	/* increase completed size and buffer pointer */
          }

