snakeiscoding/stm32f105_lcm_simulator/Libraries/FileSystem/usb_host/stm32uh/stm32uh.c
          if (aed->type==USBH_TYPE_ISO)
          {
            aed->nframe=1;				/* set next execution time for ISO transfers */
          }
          if (uht->csize==uht->size || uht->rc!=USBH_ERR_NOT_COMPLETE)
          {								/* transfer finished */
            if (uht->rc==USBH_ERR_NOT_COMPLETE) rc=USBH_SUCCESS;
                                           else rc=uht->rc;
          }
          else
          {								/* not finished - evaluate rest of the channels */
            _stm32uh_free_channel(ch);
            if (aed->type==USBH_TYPE_ISO && uht->iso_pcnt) --uht->iso_pcnt;
            continue;
          }
        }
		
     
         else if(aed->td.dir==USBH_DIR_IN && (hcint&HCC_M(ACK))) 		 
        {								/* IN ACK-ed transfer */
          hcc_u16 size=HCC_R(stsr,BCNT);
          hcc_uint i;

          aed->pid^=1;							/* save PID */
          for (i=0;i<(size>>2);i++) 			/* retrieve data in 32 bit chunks */
          {
            *(hcc_u32 *)(uht->buf+(i<<2))=*(HCC_OTG_DFIFO(ch)+i);
          }
          i<<=2;
          if (i<size)							/* if remaining data */
          {
            hcc_u32 data=*(HCC_OTG_DFIFO(ch)+(i>>2));
            hcc_u8 *_data=(hcc_u8 *)&data;
            while (i<size)
            {
              *(uht->buf+i++)=*_data++;			/* retrieve it */
            }
          }
          aed->td.hctsiz=HCC_OTG_HCTSIZ(ch);	/* save new HCTSIZ register value */
          uht->csize+=size;						/* increase completed size */
          uht->buf+=size;

          /* read size < packet size and transfer is not complete => short packet */
          if (size<aed->psize && uht->csize!=uht->size)
          {
            uht->rc=USBH_SHORT_PACKET;
          }

          /* data left to read */
          /* currently not used because one transfer can not exceed max. packet size
          else if (HCC_R(aed->td.hctsiz,XFRSIZ))
          {
            HCC_OTG_HCCHAR(ch)=HCC_OTG_HCCHAR(ch);
          }
          */
	
          continue;
        }
         
        else if (hcint&HCC_M(NAK))					/* NAK-ed transfer */
        {
          if (aed->type!=USBH_TYPE_INT)				/* not INT transfer */
          {
            if (aed->td.timeout!=USBH_WAIT_FOREVER)	/* so, check timeout */
            {
              hcc_u32 d;
              if (aframe<aed->td.cframe) aframe+=HCC_FRNUM_m+1;
              d=aframe-aed->td.cframe;
              if (d<aed->td.timeout)
              {
                aed->td.timeout-=d;
                aed->td.cframe=aframe;
              }
              else
              {
                rc=USBH_ERR_TIMEOUT;				/* timeout error */
              }
            }

            if (rc!=USBH_ERR_TIMEOUT)
            {
              if (aed->td.dir!=USBH_DIR_IN)			/* not IN transfer */
              {										/* so, need to disable channel */
                HCC_OTG_HCCHAR(ch)=HCC_M(CHENA)|HCC_M(CHDIS);	/* and retry transfer */
                aed->td.nak=1;						/* set nak flag, next interrupt will be CHH */
              }
              else
              {
                /* stop current transfer if others are pending or not enough time in the current frame */
                if (p_sched_n+np_pending_ed_cnt>TRANSFER_CHANNELS || rframe<NP_FT_REMAIN)
                {
                  aed->td.nak=1;					/* set NAK flag */
                  HCC_OTG_HCCHAR(ch)=HCC_M(CHENA)|HCC_M(CHDIS);	/* disable channel */
                }
                else
                {
                  _stm32uh_transfer_start(aed,ch);	/* restart transfer */
                }
              }
              continue;
            }
          }
          else
          {
            HCC_OTG_HCCHAR(ch)=HCC_M(CHENA)|HCC_M(CHDIS);	/* disable channel */
            aed->td.nak=1;									/* set nak flag to indicate it for the next */
            continue;										/* CHH interrupt and continue */
          }
        }
        else if (hcint&HCC_M(CHH))				/* erroneous transfer */
        {
          if (aed->td.dir!=USBH_DIR_IN)
          {										/* flush TxFIFO */
            if (aed->type==USBH_TYPE_ISO) HCC_OTG_GRSTCTL=HCC_V(TXFNUM,1)|HCC_V(TXFFLSH,1);
                                     else HCC_OTG_GRSTCTL=HCC_V(TXFFLSH,1);
          }

          if (aed->td.nak)						/* disabled because of a NAK */
          {
            if (aed->type==USBH_TYPE_INT)		/* INT transfer */
            {
              aed->nframe=aed->interval;		/* so, reset frame counter */
            }
            else
            {
              /* restart transfer only if enough channels available and enough time remains */
              if (p_sched_n+np_pending_ed_cnt<=TRANSFER_CHANNELS && rframe>=NP_FT_REMAIN)
              {
                _stm32uh_transfer_start(aed,ch);/* otherwise, restart transfer if enough channels */
              }
              else
              {
                _stm32uh_free_channel(ch);
              }
              continue;
            }
          }
          else
          {
            /* transfer error occured - restart if error was not stall and retries didn't expire */
            if((hcint&HCC_M(STALL)) || --aed->td.retry==0)
            {
              rc=USBH_ERR_TRANSFER;				/* transfer error */
            }
            else
            {
              _stm32uh_transfer_start(aed,ch);	/* restart transfer */
              continue;
            }
          }
        }

        /* remove transfer if completed or not completed but INT transfer*/
        if (rc!=USBH_ERR_NOT_COMPLETE || aed->td.nak)	
        {
          _stm32uh_free_channel(ch);
        }

        if (rc!=USBH_ERR_NOT_COMPLETE)
        {
          aed->uht=((t_uht_da *)(aed->uht->driver_area))->nuht;
          if (aed->uht==NULL)					/* there is no next transfer */
          {
            if (aed->td.ppos>=NP_BASE) --np_pending_ed_cnt;		/* decrease no. NP transfers if needed */
            pending_ed[aed->td.ppos]=NULL;						/* remove from pending list if no more transfers are pending */
          }
          uht->rc=rc;
          _stm32uh_push(&c_uht,uht);	/* put UHT to completed FIFO */
          se=1;							/* send event to transfer task if callback required */
        }
      }
    }

    if (p_sched_n || np_pending_ed_cnt)
    {
      /* only schedule new transfers if enough time remains in the current frame */
      if (rframe>NP_FT_REMAIN)
      {
        hcc_uint n_sched;
        n_sched=_stm32uh_schedule(&np_pos);
        p_sched_n=(n_sched>p_sched_n)?0:p_sched_n-n_sched;
      }
    }
    else if (HCC_OTG_HAINTMSK==0)
    {
      sched_int_state=SCHED_INT_OFF;
    }
  }
 else
  {
    hcc_u32 msk;
    hcc_u8 ch;
    /* go through all active channels disable them and mark transfer erroneous */
    for (msk=HCC_OTG_HAINTMSK,ch=0;msk;msk>>=1,ch++)
    {
      _stm32uh_remove_transfer(ch);
      se=1;
    }

