snakeiscoding/stm32f105_lcm_simulator/Libraries/FileSystem/usb_host/stm32uh/stm32uh.c
    sched_int_state=SCHED_INT_OFF;
    //HCC_OTG_GINTSTS=HCC_V(SOF,1);					/* clear SOF interrupt */
  }

//20110112 By Jason --{
 if (sched_int_state==SCHED_INT_ON)	
 	{
	if (!stm32uh_hub_connected())	
		{
		 hcc_u32 msk;
    		hcc_u8 ch;
   		 /* go through all active channels disable them and mark transfer erroneous */
    		for (msk=HCC_OTG_HAINTMSK,ch=0;msk;msk>>=1,ch++)
    		{
      		_stm32uh_remove_transfer(ch);
     		 se=1;
   		 }
	//	connected=0;
   		 sched_int_state=SCHED_INT_OFF;
		}
 	}

 //--20110112 By Jason --}

  if (se)
  {
    (void)os_event_set(1);
  }
}


/*
** Add endpoint (adds QueueHead to the list).
** INPUT: daddr - device address
**        ep - endpoint number
**        type - USBH_TYPE_CONTROL / USBH_TYPE_BULK / USBH_TYPE_INT / USBH_TYPE_ISO
**        dir - USBH_DIR_ANY / USBH_DIR_SETUP / USBH_DIR_OUT / USBH_DIR_IN
**        psize - maximum packet size
**        interval - poll interval for periodic endpoints
** RETURN: NULL - error / on success pointer to the endpoint
*/
void *stm32uh_add_ep (hcc_u8 daddr, hcc_u8 ep, hcc_u8 type, hcc_u8 dir, hcc_u16 psize, hcc_u8 interval)
{
  void *rc=NULL;
  hcc_uint i,z,f;
  hcc_u8 hub_daddr=0;	/* HUB address */
  hcc_u8 speed=0;
  hcc_u8 _type;
  t_ed *aed;

  if (stm32uh_hw_state()==USBH_ERR_SUSPENDED) return NULL;

  switch (type)
  {
    case USBH_TYPE_CONTROL: _type=HCC_EPTYP_CONTROL; break;
    case USBH_TYPE_ISO:     _type=HCC_EPTYP_ISO; break;
    case USBH_TYPE_BULK:    _type=HCC_EPTYP_BULK; break;
    case USBH_TYPE_INT:     _type=HCC_EPTYP_INTERRUPT; break;
    default: return NULL;
  }

  if (os_mutex_get(stm32uh_mutex)==OS_SUCCESS)
  {
    rc=NULL;
    z=f=TOTAL_EP;
    for (i=0;i<TOTAL_EP;i++)
    {
      if (ed[i].used)
      {
        if (ed[i].daddr==daddr)
        {
          /*if (ed[i].ep==ep && ed[i].dir==dir) break;*/
          if (ed[i].ep==0) z=i;
        }
      }
      else if (f==TOTAL_EP) f=i;
    }

    if (i==TOTAL_EP && f<TOTAL_EP)
    {
      aed=ed+f;
      rc=aed;

      aed->used=1;
      aed->daddr=daddr;
      aed->ep=ep;
      aed->type=type;
      aed->dir=dir;
      aed->psize=psize;
      if (interval<2) interval=MIN_INTERVAL;/* set minimum interval if required */
      aed->interval=interval;				/* save endpoint informarion */
      if (z<TOTAL_EP)						/* save hub address and speed if available */
      {
        aed->hub_daddr=hub_daddr;
        aed->speed=speed;
      }
      aed->nframe=0;
      aed->pid=0;							/* reset PID */

      aed->uht=NULL;
      aed->td.hcchar=HCC_V(CHENA,1u)|HCC_V(DAD,daddr)|HCC_V(EPTYP,_type)|HCC_V(EPNUM,ep)|HCC_V(MPSIZ,psize);
      if (speed==USBH_LOW_SPEED) aed->td.hcchar|=HCC_V(LSDEV,1);
    }

    (void)os_mutex_put(stm32uh_mutex);
  }

  return rc;
}



/*
** Remove all endpoints belonging to a device address
** INPUT: daddr - device address
** RERURN: USBH_SUCCESS
*/
int stm32uh_del_daddr (hcc_u8 daddr)
{
  int rc=USBH_ERR_NOT_AVAILABLE;
  t_ed *aed;
  hcc_uint i,j;

  if (stm32uh_hw_state()==USBH_ERR_SUSPENDED) return USBH_ERR_SUSPENDED;

  if (os_mutex_get(stm32uh_mutex)==OS_SUCCESS)
  {
#if OS_INTERRUPT_ENABLE
    HCC_C(HCC_OTG_GAHBCFG,GINT);/* disable interrupts to avoid parallel handling of the endpoint(s) from interrupt */
#endif
    for (i=0;i<TOTAL_EP;i++)
    {
      aed=ed+i;
      if (aed->daddr==daddr)	/* this endpoint needs to be deleted */
      {
        /* ongoing transfer, need to stop */
        if (aed->uht && ((t_uht_da *)aed->uht->driver_area)->state!=TR_ST_STOPPED)
        {
          t_usbh_transfer *uht;
          hcc_u8 ch;

          if (((t_uht_da *)aed->uht->driver_area)->state==TR_ST_RUNNING)
          {
            ch=aed->td.ch;
            _stm32uh_remove_transfer(ch);
            uht=_stm32uh_pop(&c_uht);
          }
          else
          {
            uht=aed->uht;
          }
          ((t_uht_da *)(uht->driver_area))->state=TR_ST_STOPPED;	/* set stopped state */
          if (uht->cb_fn)
          {
            (uht->cb_fn)(uht->cb_param,USBH_ERR_TRANSFER);
          }
        }

        for (j=0;j<TOTAL_TRANSFERS && pending_ed[j]!=aed;j++)
          ;
        if (j<TOTAL_TRANSFERS)
        {
          if (j>=NP_BASE) --np_pending_ed_cnt;
          pending_ed[j]=NULL;
        }
        aed->used=0;
      }
    }
#if OS_INTERRUPT_ENABLE
    HCC_S(HCC_OTG_GAHBCFG,GINT);
#endif
    (void)os_mutex_put(stm32uh_mutex);
  }
  else rc=USBH_ERR_RESOURCE;

  return rc;
}



/*
** Clear EP toggle value
** INPUT: ep_handle - endpoint handle
** RETURN: USBH_ERR_NOT_AVAILABLE - endpoint not found
**         USBH_SUCCESS
*/
int stm32uh_clear_toggle (void *ep_handle)
{
  int rc=USBH_ERR_NOT_AVAILABLE;

  if ((t_ed *)ep_handle>=ed && (t_ed *)ep_handle<(ed+TOTAL_EP))
  {
    if (os_mutex_get(stm32uh_mutex)==OS_SUCCESS)
    {
      ((t_ed *)ep_handle)->pid=0;
      (void)os_mutex_put(stm32uh_mutex);
      rc=USBH_SUCCESS;
    }
    else rc=USBH_ERR_RESOURCE;
  }

  return rc;
}



/*
** Start transfer
*/
static void _stm32uh_transfer_start (t_ed *aed, hcc_u8 ch)
{
  ch_ed[ch]=aed;								/* save ed associated to the allocated channel */
  aed->td.nak=0;
  aed->td.ch=ch;
  aed->td.ch_timeout=CHANNEL_TIMEOUT;			/* reset channel timeout */
  HCC_OTG_HCTSIZ(ch)=aed->td.hctsiz;
  HCC_OTG_HCCHAR(ch)=aed->td.hcchar;			/* start transfer */
  ((t_uht_da *)aed->uht->driver_area)->state=TR_ST_RUNNING;		/* set running transfer state */
  HCC_Sb(HCC_OTG_HAINTMSK,ch);					/* enable interrupt generation for channel i */
  if (aed->td.dir!=USBH_DIR_IN)
  {												/* write data to FIFO */
    hcc_uint i;
    for (i=0;i<(aed->td.tsize+3)>>2;i++) *(HCC_OTG_DFIFO(ch)+i)=*(hcc_u32 *)(aed->uht->buf+(i<<2));
  }
}


/*
** Init transfer
*/
static void _stm32uh_transfer_init (t_ed *aed)
{
  t_usbh_transfer *uht=aed->uht;
  hcc_u8 dpid;

  if (aed->type==USBH_TYPE_ISO && uht->iso_pcnt)
  {											/* calculate transfer size */
    aed->td.tsize=uht->iso_psize;
  }
  else
  {
    if (uht->size-uht->csize>aed->psize) aed->td.tsize=aed->psize;
                                    else aed->td.tsize=uht->size-uht->csize;
  }
  aed->td.timeout=uht->timeout;				/* set timeout */
  aed->td.retry=MAX_RETRIES;				/* reset retry counter */

