snakeiscoding/stm32f105_lcm_simulator/Libraries/FileSystem/usb_host/stm32uh/stm32uh.c
  if (aed->td.dir==USBH_DIR_SETUP)
  {											/* set PID and DIR */
    dpid=HCC_DPID_SETUP;
    HCC_C(aed->td.hcchar,EPDIR);
  }
  else
  {
    if (aed->td.dir==USBH_DIR_IN) HCC_S(aed->td.hcchar,EPDIR);
                             else HCC_C(aed->td.hcchar,EPDIR);
    if (aed->pid==0) dpid=HCC_DPID_DATA0;
                else dpid=HCC_DPID_DATA1;
  }

  if (aed->td.tsize>aed->psize)				/* set no. packets */
    aed->td.npkt=(aed->td.tsize+aed->psize-1)/aed->psize;
  else
    aed->td.npkt=1;

  /* HCCHAR is precalculated in add EP and EPDIR is set above and save HCTSIZ */
  aed->td.hctsiz=HCC_V(DPID,dpid)|HCC_V(PKTCNT,aed->td.npkt)|HCC_V(XFRSIZ,aed->td.tsize);
  aed->td.cframe=HCC_R(HCC_OTG_HFNUM,FRNUM);/* save current frame for timeuot calculation */
}


/*
** Transfer task
*/
OS_TASK_FN(stm32uh_transfer_task)
{
  hcc_u32 TimeOut=0x10000;      // Added by Jason 20110101--
#if OS_TASK_POLL_MODE==0
  for (;;)
#endif
  {
    if (os_event_get(stm32uh_event_bit)==OS_SUCCESS)
    {
      t_usbh_transfer *uht;
      uht=_stm32uh_pop(&c_uht);
      while (uht)							/* while completed transfers */
      {
        //
        TimeOut-- ;      // Added by Jason 20110101--
        //
        t_uht_da *uht_da=(t_uht_da *)uht->driver_area;
        if (uht_da->nuht==NULL)
        {
          uht_da->state=TR_ST_STOPPED;		/* set stopped state if no more transfers */
          TimeOut=0x10000;      // Added by Jason 20110101--
        }
        // Added by Jason 20110101--
        if( TimeOut == 0 )
            {
            uht_da->state=TR_ST_TIMEOUT;	/* set running state if time out */
            }
        //
        if (uht->cb_fn)						/* execute callback if needed */
        {
          (uht->cb_fn)(uht->cb_param,uht->rc);
          TimeOut=0x10000;      // Added by Jason 20110101--
        }
        uht=_stm32uh_pop(&c_uht);			/* get next completed transfer */

      }
    }
	//201101017 By Jason--{
 else
 	{

	os_event_set(2);
      
 	}
	//20110117 By Jason --}
  }
}



/*
** Get status of a transfer
** INPUT: uht - transfer descriptor
**        mode - USBH_MODE_BLOCK/USBH_MODE_NON_BLOCK
** RETURN:USBH_SUCCESS
**        USBH_SHORT_PACKET
**        USBH_ERR_TRANSFER
**        USBH_ERR_TIMEOUT
**        USBH_ERR_NOT_COMPLETE
*/
int stm32uh_transfer_status (t_usbh_transfer *uht, hcc_u8 mode)
{
  int rc=USBH_SUCCESS;
  t_uht_da *uht_da=(t_uht_da *)uht->driver_area;
  hcc_u32		temp=0; //Added by Kunlung 20110811--
 
  for (;;)
  {
  //__printf1("uht_da->state:%d\r\n",uht_da->state);
  // __printf0("\r\n\r\nstm32uh_transfer_status\r\n");
  //temp--;
#if OS_TASK_POLL_MODE
    stm32uh_transfer_task();
#endif
    if (uht_da->state==TR_ST_STOPPED)		/* transfer finished */
    {
      rc=uht->rc;
	  //temp=0xffff;
      break;
    }

    if (mode==USBH_MODE_NON_BLOCK)
    {
      rc=USBH_ERR_NOT_COMPLETE;
	  //temp=0xffff;
      break;
    }
    // Added by Jason 20110101--
    #if 1
    if (uht_da->state==TR_ST_TIMEOUT)
        {
        return USBH_ERR_TIMEOUT;
        }
    else
        { //Added by Kunlung 20110811--
        temp += 1 ;
        if( temp > 0x50000 )
            return USBH_ERR_TIMEOUT;  
        }
    #endif
    //Jason	
  }

  return rc;
}


/*
** Start transfer
** INPUT: uht - transfer descriptor
**        mode - USBH_MODE_BLOCK/USBH_MODE_NON_BLOCK
** RETURN:
*/
int stm32uh_transfer (t_usbh_transfer *uht, hcc_u8 mode)
{
  int rc=USBH_SUCCESS;
  t_ed *aed;
  t_uht_da *uht_da=(t_uht_da *)(uht->driver_area);

  if (stm32uh_hw_state()==USBH_ERR_SUSPENDED) return USBH_ERR_SUSPENDED;
  if (stm32uh_hub_connected()==0) return USBH_ERR_TRANSFER;

  uht->csize=0;
  uht->rc=USBH_ERR_NOT_COMPLETE;
  uht_da->nuht=NULL;

  if (uht->eph==NULL) uht->eph=ed;
  aed=uht->eph;

  if (aed>=ed && aed<ed+TOTAL_EP)
  {
    if (aed->uht==NULL || aed->type==USBH_TYPE_ISO)
    {
      if (uht->size==USBH_SIZE_DEFAULT) uht->size=aed->psize;

#if OS_INTERRUPT_ENABLE
      /* disable interrupts - to avoid skip of this transfer for ISO endpoints and to avoid scheduling 2 places.
         If active transfer is last in the ISO chain and the completion interrupt occurs while adding nuht then
         this transfer will never be executed. Non periodic transfers will be scheduled from this function if
         scheduling is not active from the interrupt to check this sched_int_state needs to be compared to SCHED_NONE. */
      HCC_C(HCC_OTG_GAHBCFG,GINT);
#endif
      if (os_mutex_get(stm32uh_mutex)==OS_SUCCESS)
      {
        if (aed->uht==NULL)				/* there is no active transfer for this endpoint */
        {
          hcc_uint b,n,i;

          aed->uht=uht;
          aed->td.dir=(aed->dir==USBH_DIR_ANY)?uht->dir:aed->dir;
          if (uht->toggle!=USBH_TOGGLE_PRESERVE) aed->pid=uht->toggle;

          /* get start position and no. elements for this type of transfer */
          if (aed->type==USBH_TYPE_INT)
          {
            aed->nframe=aed->interval;	/* set frames left for execution */
            b=INT_BASE;
            n=MAX_INT_TRANSFERS;
          }
          else if (aed->type==USBH_TYPE_ISO)
          {
            if (uht->timeout==USBH_ISO_IMMEDIATE) aed->nframe=1;
                                             else aed->nframe=uht->timeout;
            b=ISO_BASE;
            n=MAX_ISO_TRANSFERS;
          }
          else
          {
            aed->nframe=0;
            b=NP_BASE;
            n=MAX_NP_TRANSFERS;
          }

          for (i=0;i<n && pending_ed[i+b];i++)
            ;											/* look for an empy position in the pending list */
          if (i<n)
          {
            pending_ed[b+i]=aed;						/* add ED to pending list */
            aed->td.ppos=b+i;							/* save position in pending list */
            aed->td.ch=(hcc_u8)USBH_INVALID;

            _stm32uh_transfer_init(aed);				/* initialize transfer - to take load of the interrupt */
            aed->td.nak=1;							/* and set NAK field to avoid reiinitialization from interrupt */

            if (b==NP_BASE)							/* non periodic transfer */
            {
              ++np_pending_ed_cnt;					/* increase number of elements in NP list */
              /* schedule non periodic transfer if interrupt is not scheduling and enough time remains */
              if (HCC_R(HCC_OTG_HFNUM,FTREM)>NP_FT_REMAIN && sched_int_state==SCHED_INT_OFF)
              {										/* so, need to schedule from here */
                hcc_u8 ch;
                for (ch=0;ch<TRANSFER_CHANNELS && ch_ed[ch];ch++)
                  ;									/* look for an empty position in ch_ed */
                if (ch<TRANSFER_CHANNELS)
                {
                  _stm32uh_transfer_start(aed,ch);	/* start transfer */
                  sched_int_state=SCHED_INT_ON;
                }
              }
              else
              {
                uht_da->state=TR_ST_WAITING;		/* can't start transfer now -> set waiting state */
              }
            }
            else
            {
              uht_da->state=TR_ST_WAITING;
            }
#if OS_INTERRUPT_ENABLE
            HCC_S(HCC_OTG_GAHBCFG,GINT);
#endif
            (void)os_mutex_put(stm32uh_mutex);

