snakeiscoding/stm32f105_lcm_simulator/Libraries/FileSystem/usb_host/stm32uh/stm32uh.c
            if (rc==USBH_SUCCESS && mode==USBH_MODE_BLOCK)
            {
              rc=stm32uh_transfer_status(uht,mode);
            }
          }
          else
          {
#if OS_INTERRUPT_ENABLE
            HCC_S(HCC_OTG_GAHBCFG,GINT);
#endif
            (void)os_mutex_put(stm32uh_mutex);
            rc=USBH_ERR_TRANSFER_FULL;
          }
        }
        else							/* there is an active transfer for this endpoint */
        {								/* => set nuht */
          t_usbh_transfer *nuht=aed->uht;
          while (((t_uht_da *)(nuht->driver_area))->nuht) nuht=((t_uht_da *)(nuht->driver_area))->nuht;
          ((t_uht_da *)(nuht->driver_area))->nuht=uht;
          uht_da->state=TR_ST_WAITING;
#if OS_INTERRUPT_ENABLE
          HCC_S(HCC_OTG_GAHBCFG,GINT);
#endif
          (void)os_mutex_put(stm32uh_mutex);
        }
      }
      else rc=USBH_ERR_RESOURCE;
    }
    else rc=USBH_ERR_ONGOING_TRANSFER;
  }
  else rc=USBH_ERR_INVALID;

  return rc;
}


/*
** Delay ms number of milliseconds
*/
/*void stm32uh_delay (hcc_u32 ms)
{
  hcc_u32 frnum,afrnum;
 
  ++ms;
  frnum=HCC_R(HCC_OTG_HFNUM,FRNUM);
  while (ms)
  {
    afrnum=HCC_R(HCC_OTG_HFNUM,FRNUM);
    if (afrnum!=frnum)
    {
      --ms;
      frnum=afrnum;
    }
  }
}*/
// Jason
int stm32uh_delay (hcc_u32 ms)
{
  hcc_u32 frnum,afrnum;
  hcc_u32 temp=0xffff;	//Jason
  //hcc_u32 i=0;
  
  ++ms;
  frnum=HCC_R(HCC_OTG_HFNUM,FRNUM);
  while (ms)
  {
    afrnum=HCC_R(HCC_OTG_HFNUM,FRNUM);
  temp--;		//Jason
  if(temp==0)
      break;
    if (afrnum!=frnum)
    {
      --ms;
      temp=0xffff;	//Jason
      frnum=afrnum;
    }
  }
  //20101220 Jason--
  if (temp==0) 
    return DealyTimeOut;
  else return DealyTimeOK;
 // return DealyTimeOK;
   //--20101220 Jason
}



/*
** Set speed,HUB address and HUB speed for endpoint0
*/
int stm32uh_set_ep0_speed_hub (void *ep0_handle, hcc_u8 speed, hcc_u8 port, hcc_u8 hub_daddr, hcc_u8 hub_speed)
{
  int rc=USBH_ERR_NOT_AVAILABLE;
  t_ed *aed;

  (void)port;
  (void)hub_speed;

  if (stm32uh_hw_state()==USBH_ERR_SUSPENDED) return USBH_ERR_SUSPENDED;

  if (ep0_handle) aed=(t_ed *)ep0_handle;
             else aed=ed;
  if (aed>=ed && aed<(ed+TOTAL_EP))
  {
    aed->speed=speed;
    aed->hub_daddr=hub_daddr;
    rc=USBH_SUCCESS;
  }

  return rc;
}



/*
** Get info of an ep_handle
**
** Input: ep_handle - endpoint handler
** Output: daddr - device address
**         ep - endpoint number
**         type - endpoint type
**         dir - endpoint dir
**         psize - default packet size
** Return: USBH_SUCCESS / USB_ERR_NOT_AVAILABLE / USBH_ERR_DIR
*/
int stm32uh_get_ep_inf (void *ep_handle, hcc_u8 *daddr, hcc_u8 *ep, hcc_u8 *type, hcc_u8 *dir, hcc_u16 *psize)
{
  int rc=USBH_SUCCESS;
  t_ed *aed=(t_ed *)ep_handle;

  if (aed>=ed && aed<(ed+TOTAL_EP))
  {
    if (daddr) *daddr=aed->daddr;
    if (ep) *ep=aed->ep;
    if (type) *type=aed->type;
    if (dir) *dir=aed->dir;
    if (psize) *psize=aed->psize;
  }
  else rc=USBH_ERR_NOT_AVAILABLE;

  return rc;
}




/*
** Init STM32
*/
int stm32uh_init (void)
{
  int rc;

  rc=stm32uh_hw_init();/* init STM32 HW */
  if (rc) return rc;

  if (os_mutex_create(&stm32uh_mutex)) return USBH_ERR_RESOURCE;
  if (os_event_create(&stm32uh_event_bit)) return USBH_ERR_RESOURCE;

  rc=stm32uh_hub_init();
  if (rc) return rc;

  return USBH_SUCCESS;
}



/*
** Start STM32 host controller
*/
int stm32uh_start (hcc_u32 p)
{
  int rc;
  hcc_uint i;

  (void)p;
  _memset(ed,0,sizeof(ed));
  _memset(ch_ed,0,sizeof(ch_ed));
  _memset(&pending_ed,0,sizeof(pending_ed));
  _memset(&c_uht,0,sizeof(c_uht));
  sched_int_state=SCHED_INT_OFF;
  np_pending_ed_cnt=0;

  rc=stm32uh_hw_start();	/* init STM32 HW */
  if (rc) return rc;

  HCC_OTG_HCFG=HCC_V(FSLSPCS,1)|HCC_V(FSLSS,1);

  for (i=0;i<TRANSFER_CHANNELS;i++)					/* enable successful and abnormal completion */
  {													/* interrupts for all channels */
    HCC_OTG_HCINTMSK(i)=HCC_M(NAK)|HCC_M(ACK)|HCC_M(XFRC)|HCC_M(CHH);
  }

  HCC_S(HCC_OTG_GINTMSK,HCINT);						/* enable HCINT interrupts */
  HCC_S(HCC_OTG_GINTMSK,RXFLVL);					/* enable RXFLVL interrupts */
  HCC_S(HCC_OTG_GINTMSK,SOF);						/* enable SOF interrupts */
#if OS_INTERRUPT_ENABLE
  HCC_S(HCC_OTG_GAHBCFG,GINT);
#endif

  if (stm32uh_add_ep(0,0,USBH_TYPE_CONTROL,USBH_DIR_ANY,8,0)==NULL)
  {													/* add general control endpoint */
    return USBH_ERR_HOST;
  }

  rc=stm32uh_hub_start();							/* start root HUB */
  if (rc) return rc;


  rc=os_isr_init(STM32UH_HOST_ISR, stm32uh_isr_handler);
  if (rc) return rc;

  rc=os_isr_enable(STM32UH_HOST_ISR);
  if (rc) return rc;

  return USBH_SUCCESS;
}



/*
** Stop STM32 controller
*/
int stm32uh_stop (void)
{
  int rc;

  rc=os_isr_disable(STM32UH_HOST_ISR);				/* disable interrupts */
  if (rc) return rc;

  rc=stm32uh_hub_stop();							/* stop HUB */
  if (rc) return rc;

  return USBH_SUCCESS;
}

